// ConsoleApplication2.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

class fsef {
public:
    int gdr = 2; double fes = 5;
    void fse(int fift = 8, int glibv = 5, int fsefh = 0) {
        int globig = fift + glibv;
        std::cout << globig;
        std::cout << "fsedf\n";

    };
//private:
    static void kol() {
        std::cout << sqrt(69);
     
    };
};

int main()
{

    double iol = 0.1;
    int tr = 0;
    std::cout <<"3.14\n";
    std::cout << sqrt(43),"\n";
    std::cin >> tr;
    std::cout << "\n" << "\n Hello World\n";
    std::cout << tr;
    int trf = 1; 
    double fsfg = 1; 
    fsef* kijok = new fsef();
    kijok->fse(tr, trf, fsfg);
    
    fsef::kol(); 
    std::cout << "\n" << iol;
    //static//fsef::fse(tr, trf);
    delete kijok;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
